//Переменные и константы

var b = 5 //Переменная
b = 7 // ошибки не будет

let a = 4 // константа

var message : String // Аннотация типа (явное объявление типа переменной)
message = "hi"

var x = 0.0, y = 0.0, z = 0.0 // объявление нескольких переменных


var name, height weight : Int // Аннотация типа нескольким переменным

print("My message to uou is \(message)") // Пример интерполяции строки -  \(var or let) 

// это комментарий

/* это тоже комментарий,
но написанный на двух строках */

let cat = "?"; print(cat) // точка с запятой нужна если несколько выражений в одной строке

var int_var : Int = 5 // целочисленное значение 